Revit 2026 API

# ElementTypeIsSimilarType Method

---

Checks if given type is similar to this type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSimilarType(
	ElementId typeId
)
```
```vb
Public Function IsSimilarType (
	typeId As ElementId
) As Boolean
```
```cpp
public:
bool IsSimilarType(
	ElementId^ typeId
)
```
```fsharp
member IsSimilarType :
        typeId : ElementId -> bool
```

#### Parameters

typeId ElementId
     ElementId of the type to check.

#### Return Value

Boolean True if given type is similar to this type, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Two types are similar if elements that have one type could be assigned the other type.

#### Reference

ElementType Class

Autodesk.Revit.DB Namespace